<template>
  <section
    class="container mt-20 relative"
    v-if="!route.path.startsWith('/app')"
  >
    <p
      class="overflow-hidden text-justify"
      :class="{ 'h-32': !showAll, 'mb-5': showAll }"
    >
      صرافی ارز دیجیتال چیست و چطور کار می‌کند؟ فعالیت در دنیای کریپتوکارنسی به
      یک بستر امن، سریع و راحت نیاز دارد که انواع صرافی ارز دیجیتال این فضا را
      برای تریدرها و سرمایه‌گذاران، فراهم می‌کنند. صرافی ارز دیجیتال،پلتفرمی است
      که امکان معامله، مبادله و انجام انواع تراکنش‌های مالی با ارزهای دیجیتال را
      در اختیار ما می‌گذارد. صرافی‌های ارز دیجیتال در دو دسته‌بندی اصلی یعنی
      صرافی ارز دیجیتال متمرکز وصرافی ارز دیجیتال غیرمتمرکز قرار می‌گیرند. هر
      کدام از این مدل‌ها، مزایای اختصاصی خود را دارند و افراد بر اساس نیاز و نوع
      کار خود، باید یکی از آن‌ها را انتخاب کنند. صرافی متمرکز یک محیط امن، قابل
      اطمینان و کامل برای انجام انواع تراکنش‌های مالی را فراهم می‌کند. در صرافی
      متمرکز، یک فرد یا مجموعه به‌عنوان واسط، به تمام معامله‌ها نظارت دارد و به
      همین خاطر، احتمال کلاهبرداری، سرقت و هر گونه خطر از دست رفتن سرمایه، به
      کمترین میزان ممکن می‌رسد. پشتیبانی کامل و دقیق و امکان بررسی تمام
      تراکنش‌های پیشین، بخشی از مهم‌ترین ویژگی‌های این نوع صرافی است. در طرف
      مقابل، صرافی‌های غیر متمرکز (DEX) وجود دارند. این صرافی‌ها بدون نهاد واسط
      فعالیت می‌کنند. در این صرافی‌ها، افراد می‌توانند به‌صورت کاملا همتا به
      همتا (P2P) با هم معامله کنند و برای افراد حرفه‌ای، استفاده از این صرافی‌ها
      مناسب‌تر است. تمام صرافی‌های ارز دیجیتال، صرف نظر از متمرکز یا غیرمتمرکز
      بودن، در دسته صرافی آنلاین قرار می‌گیرند. بنابراین از هر نقطه دنیا و تنها
      با اتصال به اینترنت، می‌توانید به آن‌ها دسترسی داشته باشید. چطور یک صرافی
      رمزارز معتبر را تشخیص دهیم؟ با وجود نام‌های متنوع و کاربردهای گوناگون،
      بدون شک انتخاب یک صرافی ارز دیجیتال اهمیت فراوانی دارد. برخی از مهم‌ترین
      فاکتورهای انتخاب یک صرافی عبارتند از: مجوزهای صرافی امنیت و اعتبار دیدگاه
      کاربران و مشتریان پشتیبانی و پاسخگویی مناسب امکانات و خدمات آیا صرافی‌های
      ارز دیجیتال ایرانی با صرافی‌های خارجی تفاوت دارند؟ صرافی‌های ارز دیجیتال
      بین‌المللی نسبت به صرافی‌های ارز دیجیتال ایرانی در بازه کوتاه‌تری
      رمزارزهای نوظهور را در فهرست ارزهای قابل معامله خود قرار می‌دهند، حجم
      معاملات بسیار بالاتری دارند و ممکن است امکانات معاملاتی بیشتری را نیز به
      کاربران خود ارائه کنند. با این وجود، صرافی‌های ایرانی ارز دیجیتال نیز تلاش
      کرده‌اند تا فاصله خود را با صرافی‌های خارجی کم‌تر کرده و امکانات مورد نیاز
      کاربران ایرانی را تا حد ممکن فراهم کنند. همچنین سرمایه کاربران ایرانی در
      صرافی‌های داخلی از امنیت بسیار بالاتری برخوردار است. با توجه به تحریم‌های
      اقتصادی، اغلب صرافی‌های معتبر خارجی به کاربران ایرانی هیچ‌گونه خدماتی
      ارائه نمی‌کنند. هر چند امکان استفاده از فیلترشکن برای دور زدن این
      محدودیت‌ها وجود دارد، اما احتمال کشف شدن هویت ایرانی کاربران و مسدود شدن
      حساب آن‌ها نیز بسیار بالا است. بنابراین اگر می‌خواهید امنیت سرمایه خود را
      حفظ کنید، استفاده از یکی از بهترین صرافی‌های ارز دیجیتال ایرانی مثل والکس،
      گزینه بسیار معقول‌تری برای شما است. چرا باید صرافی والکس را برای معاملاتم
      انتخاب کنم؟ در میان صرافی‌های معتبر ایرانی، والکس توانسته با ویژگی‌های
      خود، به یکی از بهترین صرافی‌های ایرانی برای کاربران داخلی تبدیل شود. والکس
      با ارائه پیشرفته‌ترین امکانات، پلتفرمی کارآمد در سطح برترین صرافی‌های
      معتبر جهانی ایجاد کرده است که امکان ترید کردن و انجام انواع تراکنش به
      ساده‌ترین روش را برای همگان امکان‌پذیر می‌کند. برخی از مهم‌ترین امکانات
      والکس شامل موارد زیر هستند: بازارهای معاملاتی پیشرفته در والکس امکان
      فعالیت در بازار تومان و تتر وجود دارد. همه داده‌های مورد نیاز برای آغاز
      فعالیت هم‌چون تغییرات جهانی قیمت‌ها و نوسانات، نمودارهای تحلیل ارز و هر
      نوع اطلاعات مهم دیگر در این بخش در اختیار تریدرها قرار گرفته است. معامله
      تعهدی با شورت و لانگ در معاملات تعهدی یا Margin Trading شما می‌توانید
      هنگام معامله، اعتبار دریافت کنید؛ سپس در صورت تحلیل درست روند قیمت، تا چند
      برابر در بازار نزولی یا صعودی سود کنید. نسبت اعتبار در بازار تعهدی والکس
      تا ۱۰X برای کاربران فعال شده و شما می‌توانید تا ۱۰ برابر سود بیشتر کسب
      کنید. امکان خرید و فروش آنی علاوه بر امکان معامله‌های همتا به همتا، والکس
      امکان خرید و فروش آنی برای کوتاه‌کردن فرآیند انتظار خرید و فروش را نیز
      ارائه کرده است. با استفاده از این قابلیت، تنها در کمتر از یک دقیقه
      می‌توانید ارزهای خود را فروخته و سرمایه خود را به تومان یا دیگر ارزهای مد
      نظرتان، تبدیل کنید. کاربران می‌توانند با استفاده از این امکان در والکس
      خرید ارز دیجیتال خود را در کوتاه‌ترین زمان انجام دهند و با خیال آسوده
      دارای دیجیتال خود را در کیف پول امن والکس نگهداری کنند. انواع بات‌های
      معامله‌گر رایگان والکس با فراهم کردن بات‌های معامله‌گر ،امکان معامله
      خودکار را برای کاربران خود فراهم کرده است. برخی از پرکاربردترین بات‌های
      موجود در والکس شامل مارجین گرید، اسپات گرید، مارتینگل،اینفینیتی گرید و
      اسمارت ریبالانس هستند. اعتبار معاملاتی ارائه وجه اعتباری به کاربران برای
      آغاز فعالیت در بازارهای کریپتوکارنسی، یکی دیگر از مزیت‌های استفاده از
      والکس است. همه می‌توانند از راه معامله‌ی ارزهای دیجیتال به سود برسند، اما
      خیلی از افراد شاید نتوانند اعتبار کافی برای کسب سود مناسب، وارد معاملات
      خود کنند. والکس با بررسی نیازهای معامله‌گران، محصولی با عنواناعتبار
      معاملاتیارائه کرده که به کمک آن، می‌توان از طرح‌های گوناگون برای
      به‌دست‌آوردن اعتبار ارز دیجیتال و در نتیجه سود بیشتر، استفاده کرد. اعتبار
      معاملاتی در واقع تسهیل‌گر کسب سود در دنیای رمزارزها است. با استفاده از این
      امکان، کاربران می‌توانند تا سقف ۴۰۰ میلیون تومان اعتبار معاملاتی دریافت
      کنند. اپلیکیشن معاملاتی والکس با ارائه اپلیکیشن ارز دیجیتال تلفن همراه
      برای هر دو سیستم عامل اندروید و iOS، خرید و فروش ارزهای دیجیتال را آسان
      کرده است. با دانلود اپلیکیشن ارز دیجیتال والکس و استفاده از آن شما در همه
      جا می‌توانید به معاملات و کیف پول خود دسترسی داشته باشید و دارایی خود را
      مدیریت کنید. پشتیبانی ۲۴/۷ فعالیت در دنیای رمزارزها با چالش‌های مختلفی
      همراه است که یک پشتیبانی به‌موقع و دقیق، می‌تواند بخش زیادی از این
      دغدغه‌ها را از بین ببرد. در والکس امکان پشتیبانی آنلاین و ۲۴ ساعته در ۷
      روز هفته وجود دارد. تمامی پرسش‌های کاربران در مدت زمان بسیار کوتاهی توسط
      تیم پشتیبانی مجموعه پاسخ داده می‌شوند و با خیال راحت می‌توانید در هر زمانی
      از روز، از کارشناسان این بخش کمک بگیرید. امنیت بسیار بالا والکس به‌عنوان
      بهترین صرافی ارز دیجیتال، حفظ امنیت سرمایه کاربران خود را بالاترین اولویت
      خود می‌داند. استفاده از کیف پول سرد برای محافظت از سرمایه تریدرها و
      سرمایه‌گذاران، استفاده از سیستم‌های امنیتی قوی، احراز هویت کامل و رمز عبور
      دو مرحله‌ای، تنها بخشی از راهکارهای امنیتی والکس برای تامین امنیت
      دارایی‌های شما هستند. کارمزد منصفانه با این‌که اخذ کارمزد در نگاه اول
      چندان مهم به نظر نمی‌رسد، اما یکی از مهم‌ترین مشخصه‌ها برای انتخاب یک
      صرافی رمز ارز معتبر محسوب می‌شود. والکس با اخذ کارمزد نسبتا کم و معقول به
      نسبت دیگر صرافی‌های ایرانی ارز دیجیتال، سعی دارد تا هزینه قابل توجهی را به
      کاربران خود تحمیل نکند. ابزارهای حرفه‌ای معامله امکان قرار دادن حد سود و
      ضرر (Stop Loss) یک ویژگی کلیدی در خرید ارز دیجیتال و فروش آن است. با
      استفاده از استاپ لاس در صرافی والکس می‌توانید حرفه‌ای‌تر از گذشته در بازار
      کریپتوکارنسی سرمایه‌گذاری و معامله کنید. در کنار استاپ لاس، شما می‌توانید
      با اعمال فیلتر روی لیست سفارش‌های خود بر اساس بازار مورد نظر، سوابق
      تراکنش‌های خود را مشاهده و در صورت نیاز خروجی اکسل از آن‌ها دریافت کنید.
      خدمات API والکس یک ویژگی مهم برای کاربران حرفه‌ای است. شما در والکس به دو
      صورت عمومی و خصوصی می‌توانید به این مستندات دسترسی داشته باشید. صرافی ارز
      دیجیتال والکس با ارائه امکانات تحلیلی روی چارت‌ها از جمله امکان قرار دادن
      بازه‌های زمانی مختلف روی نمودار، استفاده از نمودار‌های خطی و ابزارهای
      تحلیلی، یک امکان پیشرفته برای خرید و فروش ارزهای دیجیتال در اختیار تریدرها
      قرار داده است. رابط کاربری آسان و قابل درک دیگر ویژگی والکس رابط کاربری
      شفاف و ساده این پلتفرم است. تمام افراد با هر میزان دانش از دنیای رمزارزها،
      به‌راحتی می‌توانند فعالیت خود را در این صرافی آغاز کنند. همه مراحل از لحظه
      ثبت نام تا اولین فرآیند ترید، در بخش‌های مختلف این پلتفرم آموزش داده شده و
      کاربران بدون داشتن هیچ‌گونه دانش اولیه، می‌توانند فعالیت خود را در این
      صرافی شروع کنند. با وجود همه این مشخصه‌های بی‌نظیر، والکس محبوبیت بسیار
      زیادی در بین تریدرها، سرمایه‌گذاران و هولدر‌های ایرانی دارد و می‌تواند
      به‌عنوان بهترین صرافی ارز دیجیتال ایرانی شناخته می‌شود. ما در مجموعه والکس
      پذیرای دیدگاه‌ها و پیشنهادهای شما برای بهبود خدمات خود هستیم. شما
      می‌توانید از طریق حساب‌های رسمی والکس در شبکه‌های اجتماعی یا تماس با
      پشتیبانی، نظرات خود را با ما به اشتراک بگذارید تا بیش از پیش بتوانیم
      انتظارات کاربران از یک پلتفرم معاملاتی برتر را برآورده کنیم.
    </p>
    <div
      v-if="!showAll"
      class="absolute bottom-0 left-0 w-full h-32 bg-gradient-to-t from-white dark:from-maindark to-transparent flex justify-center items-end pb-2"
    >
      <button
        class="px-4 py-2 bg-[#EEF4FF] dark:bg-[#252525] text-[#0088FF] rounded-full flex items-center gap-2 cursor-pointer"
        @click="showAll = true"
      >
        بیشتر
        <svg
          width="14"
          height="9"
          viewBox="0 0 14 9"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M1 1.5L6.85858 7.4406C6.93668 7.5198 7.06332 7.5198 7.14142 7.4406L13 1.5"
            stroke="#0088FF"
            stroke-width="1.5"
            stroke-linecap="round"
          />
        </svg>
      </button>
    </div>
  </section>
</template>

<script setup>
let route = useRoute()

let showAll = ref(false)
</script>
