<template>
  <section class="lg:mb-6">
    <div
      class="flex justify-between items-center border-b border-hover pb-2 mb-2 text-xs"
    >
      <h3>حداقل مقدار برداشت</h3>
      <span>7.000.000 تومان</span>
    </div>
    <div class="text-xs">
      <p>
        برداشت فوری: در کمتر از 30 دقیقه تکمیل میشود، حتی در روزهای تعطیل سقف
        برداشت برای هر کارت: 10 میلیون تومان
      </p>
      <p class="my-4">
        برداشت نیمه فوری: فقط در روزهای کاری پردازش و تکمیل می شود. سقف برداشت
        روزانه هر کارت: 50 میلیون تومان
      </p>
      <p class="mb-4">
        برداشت عادی: فقط در روزهای کاری پردازش و تکمیل می شود. سقف برداشت روزانه
        هر کارت: 100 میلیون تومان (برای مبالغ بالاتر از چند کارت یا روزهای متولی
        استفاده کنید)
      </p>
      <p>
        تمام برداشت ها پس از ثبت، پردازش شده و در اولین زمان ممکن یا حداکثر 48
        ساعت تسویه خواهند شد.
      </p>
    </div>
  </section>
</template>
