<template>
  <section class="md:grid grid-cols-2 gap-5">
    <div>
      <h2 class="mb-4">ارز بین المللی ندارید؟</h2>
      <NuxtLink
        to="/"
        class="flex justify-between items-center bg-white dark:bg-maindark p-4 rounded-xl mb-5 h-[90px]"
      >
        <div class="flex items-center gap-3">
          <svg
            width="26"
            height="22"
            viewBox="0 0 26 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M15.9166 9.83317C15.9166 10.6067 15.6093 11.3486 15.0623 11.8956C14.5153 12.4425 13.7735 12.7498 12.9999 12.7498C12.2264 12.7498 11.4845 12.4425 10.9375 11.8956C10.3905 11.3486 10.0833 10.6067 10.0833 9.83317C10.0833 9.05962 10.3905 8.31776 10.9375 7.77078C11.4845 7.22379 12.2264 6.9165 12.9999 6.9165C13.7735 6.9165 14.5153 7.22379 15.0623 7.77078C15.6093 8.31776 15.9166 9.05962 15.9166 9.83317Z"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M24.6666 12.1665V3.91467C24.6666 3.252 24.2886 2.65234 23.6551 2.45634C22.5549 2.11334 20.5588 1.6665 17.6666 1.6665C12.3233 1.6665 10.8964 3.623 3.52425 2.16117C2.40775 1.9395 1.33325 2.769 1.33325 3.9065V15.593C1.33325 16.3957 1.88509 17.1015 2.66909 17.2742C8.78825 18.624 11.0539 17.7618 14.1666 17.2543"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M1.33325 6.33333C3.60942 6.33333 5.65575 4.4725 5.91709 2.54633M20.5833 2.25C20.5833 4.63 22.6424 6.8805 24.6666 6.8805M5.99992 17.412C5.99992 16.1743 5.50825 14.9873 4.63308 14.1122C3.75791 13.237 2.57093 12.7453 1.33325 12.7453M21.1666 13.3333V20.3333M17.6666 16.8333H24.6666"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
          <div>
            <h3>افزایش موجودی (واریز تومانی)</h3>
            <p class="text-[#00000666] dark:text-textdark text-sm mt-1">
              برای انجام حواله، ابتدا کیف پول تومانی خود را از طریق کارت بانکی
              شارژ کنید.
            </p>
          </div>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="18px"
          height="18px"
          viewBox="0 0 1024 1024"
        >
          <path
            fill="currentColor"
            d="M609.408 149.376L277.76 489.6a32 32 0 0 0 0 44.672l331.648 340.352a29.12 29.12 0 0 0 41.728 0a30.59 30.59 0 0 0 0-42.752L339.264 511.936l311.872-319.872a30.59 30.59 0 0 0 0-42.688a29.12 29.12 0 0 0-41.728 0"
          />
        </svg>
      </NuxtLink>
      <NuxtLink
        to="/"
        class="flex justify-between items-center bg-white dark:bg-maindark p-4 rounded-xl h-[90px]"
      >
        <div class="flex items-center gap-3">
          <svg
            width="28"
            height="28"
            viewBox="0 0 28 28"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M23.0359 15.1669C23.8552 13.9892 24.3498 12.6165 24.4699 11.1869C24.5901 9.75727 24.3315 8.32125 23.7202 7.02336C23.1089 5.72547 22.1665 4.61152 20.9878 3.79362C19.8092 2.97572 18.4359 2.48274 17.0061 2.3643C15.5764 2.24587 14.1407 2.50616 12.8435 3.11897C11.5464 3.73178 10.4335 4.67549 9.61699 5.85511C8.80048 7.03472 8.30912 8.40862 8.19237 9.83849C8.07562 11.2684 8.3376 12.7038 8.95194 14.0002"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M14.511 13.6117V7.38866M16.3333 7.38866V5.8335M16.3333 15.1668V13.6117M14.511 10.5002H18.1557M18.1557 10.5002C18.76 10.5002 19.25 11.0228 19.25 11.6668V12.445C19.25 13.089 18.76 13.6117 18.1568 13.6117H13.4167M18.1557 10.5002C18.7588 10.5002 19.25 9.9775 19.25 9.3335V8.55533C19.25 7.91133 18.76 7.38866 18.1568 7.38866H13.4167M3.5 16.3335H6.29417C6.63717 16.3335 6.9755 16.4105 7.28233 16.5598L9.66467 17.7125C9.9715 17.8607 10.3098 17.9377 10.654 17.9377H11.8697C13.0457 17.9377 14 18.8605 14 19.9992C14 20.0458 13.9685 20.0855 13.923 20.0983L10.9585 20.9185C10.4266 21.0654 9.85934 21.014 9.3625 20.7738L6.81567 19.5418M14 19.2502L19.3585 17.604C19.825 17.4609 20.3248 17.4687 20.7866 17.6265C21.2483 17.7842 21.6484 18.0838 21.9298 18.4825C22.3603 19.0775 22.1853 19.9315 21.5577 20.2932L12.7902 25.353C12.516 25.5116 12.2124 25.6128 11.8979 25.6503C11.5834 25.6878 11.2646 25.6609 10.9608 25.5712L3.5 23.3568"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
          <div>
            <h3>واریز ارز دیجیتال</h3>
            <p
              class="text-[#00000666] dark:text-textdark text-sm mt-1 max-w-sm"
            >
              موجودی ارز دیجیتال خود را از کیف پول‌های شخصی، به کیف پول‌تان در
              صرافی کازان واریز کنید.
            </p>
          </div>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="18px"
          height="18px"
          viewBox="0 0 1024 1024"
        >
          <path
            fill="currentColor"
            d="M609.408 149.376L277.76 489.6a32 32 0 0 0 0 44.672l331.648 340.352a29.12 29.12 0 0 0 41.728 0a30.59 30.59 0 0 0 0-42.752L339.264 511.936l311.872-319.872a30.59 30.59 0 0 0 0-42.688a29.12 29.12 0 0 0-41.728 0"
          />
        </svg>
      </NuxtLink>
    </div>
    <div>
      <h2 class="mb-4">ارز بین المللی دارید؟</h2>
      <NuxtLink
        to="/"
        class="flex justify-between items-center bg-white dark:bg-maindark p-4 rounded-xl mb-5 h-[90px]"
      >
        <div class="flex items-center gap-3">
          <svg
            width="28"
            height="28"
            viewBox="0 0 28 28"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16.3333 2.59271C15.5788 2.43871 14.801 2.36093 13.9999 2.35938C7.55642 2.35938 2.33325 7.57671 2.33325 14.0132C2.33325 20.4497 7.55642 25.667 13.9999 25.667C20.4434 25.667 25.6666 20.4497 25.6666 14.0132C25.665 13.2144 25.5873 12.4374 25.4333 11.6822"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
            />
            <path
              d="M13.9998 10.5166C12.7107 10.5166 11.6665 11.2994 11.6665 12.2654C11.6665 13.2302 12.7107 14.0131 13.9998 14.0131C15.289 14.0131 16.3332 14.7947 16.3332 15.7607C16.3332 16.7267 15.289 17.5096 13.9998 17.5096M13.9998 10.5166C15.0148 10.5166 15.8805 11.0031 16.2002 11.6832M13.9998 10.5166V9.35107M13.9998 17.5096C12.9848 17.5096 12.1192 17.0231 11.7995 16.3429M13.9998 17.5096V18.6751"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
            />
            <path
              d="M25.6608 2.3335L20.7899 7.20316M19.8286 2.94133L19.9663 6.544C19.9663 7.39333 20.4738 7.923 21.3989 7.9895L25.0436 8.161"
              stroke="#252525"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
          <div>
            <h3>واریز ارز بانکی</h3>
            <p
              class="text-[#00000666] dark:text-textdark text-sm mt-1 max-w-sm"
            >
              از طریق حساب بانکی شخصی یا اعضای درجه یک خانواده در خارج از کشور،
              ارز بانکی را به کیف پول خود منتقل کنید.
            </p>
          </div>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="18px"
          height="18px"
          viewBox="0 0 1024 1024"
        >
          <path
            fill="currentColor"
            d="M609.408 149.376L277.76 489.6a32 32 0 0 0 0 44.672l331.648 340.352a29.12 29.12 0 0 0 41.728 0a30.59 30.59 0 0 0 0-42.752L339.264 511.936l311.872-319.872a30.59 30.59 0 0 0 0-42.688a29.12 29.12 0 0 0-41.728 0"
          />
        </svg>
      </NuxtLink>
    </div>
  </section>
</template>
