<template>
  <section class="flex gap-3 p-3 rounded-10 bg-[#FDF8EB] lg:mt-6">
    <svg
      width="24"
      height="24"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      class="flex-shrink-0"
    >
      <path
        opacity="0.5"
        d="M12 3C9.69 3 8.23 5.587 5.312 10.762L4.948 11.406C2.523 15.706 1.31 17.856 2.406 19.428C3.502 21 6.214 21 11.636 21H12.364C17.786 21 20.498 21 21.594 19.428C22.69 17.856 21.477 15.706 19.052 11.406L18.688 10.761C15.77 5.587 14.311 3 12 3Z"
        fill="#A06F0C"
      />
      <path
        d="M12 7.25C12.1989 7.25 12.3897 7.32902 12.5303 7.46967C12.671 7.61032 12.75 7.80109 12.75 8V13C12.75 13.1989 12.671 13.3897 12.5303 13.5303C12.3897 13.671 12.1989 13.75 12 13.75C11.8011 13.75 11.6103 13.671 11.4697 13.5303C11.329 13.3897 11.25 13.1989 11.25 13V8C11.25 7.80109 11.329 7.61032 11.4697 7.46967C11.6103 7.32902 11.8011 7.25 12 7.25ZM12 17C12.2652 17 12.5196 16.8946 12.7071 16.7071C12.8946 16.5196 13 16.2652 13 16C13 15.7348 12.8946 15.4804 12.7071 15.2929C12.5196 15.1054 12.2652 15 12 15C11.7348 15 11.4804 15.1054 11.2929 15.2929C11.1054 15.4804 11 15.7348 11 16C11 16.2652 11.1054 16.5196 11.2929 16.7071C11.4804 16.8946 11.7348 17 12 17Z"
        fill="#A06F0C"
      />
    </svg>
    <div class="text-[#A06F0C]">
      <h4 class="font-bold mb-1">توجه</h4>
      <p class="text-xs">
        لطفاً در صورت استفاده از فیلترشکن آن را خاموش کنید به دستور پلیس فتا
        برای برداشت کوین IP شما باید کشور ایران یا روسیه باشد از واریز کوین به
        حساب افراد ناشناس که از طریق آگهی های درآمدزایی و ... شما را پیدا کرده
        اند خودداری کنید. این شیوه کلاه برداری بوده و مسئولیت جرم صورت گرفته
        متوجه شما خواهد بود
      </p>
    </div>
  </section>
</template>
