<template>
  <section class="grid grid-cols-3 gap-3">
    <article
      v-for="item in 3"
      class="bg-white dark:bg-maindark rounded-2xl border border-[#F0F0F0] dark:border-[#2B2B2B] p-5 pb-7"
    >
      <svg
        width="32"
        height="32"
        viewBox="0 0 32 32"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        class="dark:hidden"
      >
        <path
          d="M19.0669 17.4814H13.7086C13.1523 17.4814 12.7812 16.899 13.0095 16.3841L19.067 3.58418C19.3146 3.02576 19.8618 2.66663 20.4652 2.66663H26.623C27.203 2.66663 27.5729 3.2952 27.2979 3.81357L23.1487 11.6345C22.8737 12.1529 23.2436 12.7815 23.8237 12.7815H28.5653C29.2159 12.7815 29.5707 13.5523 29.1532 14.0588L16.6558 29.2195C16.4329 29.4899 16.0086 29.2351 16.1349 28.9067L19.7811 18.5423C19.9772 18.0322 19.6065 17.4814 19.0669 17.4814Z"
          stroke="#33323B"
          stroke-width="1.5"
        />
        <path
          d="M2.66667 5.33337H11.6078M2.66667 26.0741H10.8628M4.90197 11.2593H8.62746M2.66667 20.1482H7.88236"
          stroke="#0057FF"
          stroke-width="1.5"
          stroke-linecap="round"
        />
      </svg>
      <svg
        width="32"
        height="32"
        viewBox="0 0 32 32"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        class="hidden dark:block"
      >
        <path
          d="M19.067 17.4814H13.7086C13.1523 17.4814 12.7813 16.899 13.0096 16.3841L19.0671 3.58418C19.3146 3.02576 19.8619 2.66663 20.4652 2.66663H26.623C27.2031 2.66663 27.573 3.2952 27.298 3.81357L23.1488 11.6345C22.8737 12.1529 23.2437 12.7815 23.8237 12.7815H28.5653C29.216 12.7815 29.5708 13.5523 29.1533 14.0588L16.6558 29.2195C16.4329 29.4899 16.0087 29.2351 16.135 28.9067L19.7811 18.5423C19.9773 18.0322 19.6066 17.4814 19.067 17.4814Z"
          stroke="white"
          stroke-width="1.5"
        />
        <path
          d="M2.66675 5.33337H11.6079M2.66675 26.0741H10.8628M4.90204 11.2593H8.62753M2.66675 20.1482H7.88244"
          stroke="#0057FF"
          stroke-width="1.5"
          stroke-linecap="round"
        />
      </svg>
      <h4 class="my-3 font-bold text-sm text-lables dark:text-white">
        معاملات سریع و بدون کارمزد
      </h4>
      <p class="text-textlight text-xs">
        به‌صورت ۲۴ ساعته ارزهای فیات و دیجیتال را بدون کارمزد خرید و فروش کنید.
      </p>
    </article>
  </section>
</template>
