<template>
  <article class="p-4 bg-white rounded-10">
    <h4 class="font-bold mb-5 text-sm">اصلاح سبک بیت‌ کوین قبل از ۱۱۵ هزار دلار؟</h4>
    <div class="flex items-center justify-between mb-4">
      <div class="flex items-center gap-2">
        <img src="/crypto/BTC.svg" class="size-4" alt="btc icon" />
        <NuxtLink to="/" class="text-primary text-xs underline"
          >تحلیل بیت کوین</NuxtLink
        >
      </div>
      <span
        class="p-1 text-success-c bg-[#E5F8F3] rounded-full flex items-center gap-1 text-xs"
      >
        صعودی
        <svg
          width="16"
          height="16"
          viewBox="0 0 16 16"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M14.6132 4.41333C14.5456 4.25043 14.4161 4.12098 14.2532 4.05333C14.1731 4.01917 14.087 4.00105 13.9999 4H10.6665C10.4897 4 10.3202 4.07024 10.1951 4.19526C10.0701 4.32029 9.99988 4.48986 9.99988 4.66667C9.99988 4.84348 10.0701 5.01305 10.1951 5.13807C10.3202 5.2631 10.4897 5.33333 10.6665 5.33333H12.3932L8.66654 9.06L6.47321 6.86C6.41124 6.79751 6.3375 6.74792 6.25626 6.71407C6.17502 6.68023 6.08789 6.6628 5.99988 6.6628C5.91187 6.6628 5.82473 6.68023 5.74349 6.71407C5.66225 6.74792 5.58852 6.79751 5.52654 6.86L1.52654 10.86C1.46406 10.922 1.41446 10.9957 1.38062 11.0769C1.34677 11.1582 1.32935 11.2453 1.32935 11.3333C1.32935 11.4213 1.34677 11.5085 1.38062 11.5897C1.41446 11.671 1.46406 11.7447 1.52654 11.8067C1.58852 11.8692 1.66225 11.9187 1.74349 11.9526C1.82473 11.9864 1.91187 12.0039 1.99988 12.0039C2.08789 12.0039 2.17502 11.9864 2.25626 11.9526C2.3375 11.9187 2.41124 11.8692 2.47321 11.8067L5.99988 8.27333L8.19321 10.4733C8.25519 10.5358 8.32892 10.5854 8.41016 10.6193C8.4914 10.6531 8.57854 10.6705 8.66654 10.6705C8.75455 10.6705 8.84169 10.6531 8.92293 10.6193C9.00417 10.5854 9.0779 10.5358 9.13988 10.4733L13.3332 6.27333V8C13.3332 8.17681 13.4034 8.34638 13.5285 8.47141C13.6535 8.59643 13.8231 8.66667 13.9999 8.66667C14.1767 8.66667 14.3463 8.59643 14.4713 8.47141C14.5963 8.34638 14.6665 8.17681 14.6665 8V4.66667C14.6655 4.57955 14.6474 4.49348 14.6132 4.41333Z"
            fill="#039874"
          />
        </svg>
      </span>
    </div>
    <div
      src="/app/banner.jpg"
      class="rounded-10 w-full bg-primary h-[180px]"
      alt="banner"
    />
    <div class="flex justify-between items-center my-2">
      <div class="flex items-center gap-1">
        <div
          class="flex-center size-10 rounded-full font-bold bg-[#EEF4FF] text-primary"
        >
          ب
        </div>
        <h5 class="text-sm">اشکان محبی</h5>
      </div>
      <span class="text-bar text-xs">17 روز پیش</span>
    </div>
    <p class="text-bar text-xs">رو تایم فریم 2 ساعته</p>
  </article>
</template>
