<template>
  <section class="mt-4">
    <div
      v-for="item in items"
      :key="item.title"
      class="bg-selected rounded-10 p-3 mb-2 last:mb-0"
    >
      <h3 class="font-bold text-xs">{{ item.title }}</h3>
      <p class="text-2sm mt-1">{{ item.par }}</p>
    </div>
  </section>
</template>

<script setup>
let items = ref([
  {
    title: 'اطمینان از شماره رسمی',
    par: 'ما اطلاعات حساب را فقط و فقط از شماره رسمی زیر ارسال می‌کنیم. به هیچ شماره دیگری، حتی با نام و لوگوی مشابه، اعتماد نکنید. +7 (919) 777-4661'
  },
  {
    title: 'کنترل شماره سفارش',
    par: 'اولین قدم: شماره سفارش دریافتی در واتساپ را با شماره ثبت شده در سایت مطابقت دهید. هرگونه مغایرت، نشانه‌ی کلاهبرداری است؛ فوراً ارتباط را قطع کنید.'
  },
  {
    title: 'مسئولیت‌پذیری نهایی',
    par: `لطفاً توجه داشته باشید که کازان هیچ مسئولیتی در قبال ارتباط شما با شماره‌های دیگر و ضرر و زیان احتمالی ناشی از آن ندارد. همانطور که در قوانین سایت نیز تأکید شده، حفظ امنیت دارایی‌ها مسئولیت مشترک ما و شماست.`
  }
])
</script>
